Repository: Majuo/thesis
Catalog: sudoku_app/lib/l10n/app_*.arb
Languages: et, ru

source: Color scheme
et: Värviskeem
ru: Цветовая схема

# darkTheme
source: Dark
et: Tume
ru: Тёмная

# lightTheme
source: Light
et: Hele
ru: Светлая

# highContrastTheme
source: High contrast
et: Kõrge kontrastsusega
ru: Высококонтрастная

source: Language
et: Keel
ru: Язык

source: Sudoku rules
et: Sudoku reeglid
ru: Правила Судоку

source: Last remaining cell
et: Ainus võimalik ruut
ru: Единственная возможная клетка

source: Last possible number
et: Ainus võimalik number
ru: Единственное возможное число

# hintCanNotBeSolved
source: This Sudoku can't be solved with known techniques
et: Antud Sudoku ei ole võimalik lahendada teadaolevate tehnikate abil
ru: Данное Судоку невозможно решить с помощью известных техник решения

# hintCanBeSolvedUsingSingleCell
source: Technique can be applied to the highlighted cell:
et: Märgitud ruudul saab rakendada tehnikat:
ru: Для выделенной клетки может быть применена техника:

# hintCanBeSolvedUsingMultipleCells
source: Technique can be applied to the highlighted cells:
et: Märgitud ruutudel saab rakendada tehnikat:
ru: Для выделенных клеток может быть применена техника:

# nakedSingle
source: Naked singles
et: Alasti üksik
ru: Голые единицы

# nakedPair
source: Naked pairs
et: Alasti paar
ru: Голые пары

# nakedTriple
source: Naked triples
et: Alasti kolmik
ru: Голые тройки

# hiddenSingle
source: Hidden singles
et: Peidetud üksik
ru: Скрытые единицы

# hiddenPair
source: Hidden pairs
et: Peidetud paar
ru: Скрытые пары

# hiddenTriple
source: Hidden triples
et: Peidetud kolmik
ru: Скрытые тройки

# pointingPair
source: Pointing pairs
et: Osutav paar
ru: Указывающие пары

# pointingTriple
source: Pointing triples
et: Osutav kolmik
ru: Указывающие тройки

# fillCandidates
source: Fill pencil marks
et: Täida pliiatsimärgid
ru: Заполнить заметки

source: X-wing
et: X-tiib
ru: X-крыло

source: Y-wing
et: Y-tiib
ru: Y-крыло

source: Swordfish
et: Mõõkkala
ru: Рыба-меч

source: New game
et: Uus mäng
ru: Новая игра

source: Easy
et: Kerge
ru: Легкий

source: Medium
et: Keskmine
ru: Средний

source: Hard
et: Raske
ru: Сложный

source: Very hard
et: Väga raske
ru: Очень сложный

# menuItemGame
source: Game
et: Mäng
ru: Игра

# menuItemLearning
source: Learning
et: Õppimine
ru: Обучение

# menuItemSettings
source: Settings
et: Seaded
ru: Настройки

source: Reset
et: Tühista
ru: Сбросить

# navigationMenuOption
source: Navigation menu
et: Navigeerimismenüü
ru: Меню навигации

# textSizeOption
source: Text size
et: Teksti suurus
ru: Размер текста

source: Adaptive
et: Adaptiivne
ru: Адаптивное

# bottomNavigationBar
source: Bottom
et: Allpool
ru: Снизу

source: Sidebar
et: Külgriba
ru: Сбоку

source: Hint
et: Vihje
ru: Подсказка

source: Pencil marks
et: Pliiatsimärgid
ru: Заметки

source: Basics
et: Algteadmised
ru: Основы

source: Beginner techniques
et: Algaja tehnikad
ru: Начальные техники

source: Intermediate techniques
et: Kesktaseme tehnikad
ru: Более сложные техники

source: Advanced techniques
et: Edasijõudnud tehnikad
ru: Продвинутые техники

source: Welcome!
et: Tere tulemast!
ru: Добро пожаловать!

# seeBasics
source: Would you like to see Sudoku rules first?
et: Kas tahad kõigepealt näha Sudoku reegleid?
ru: Хочешь сначала посмотреть правила Судоку?

# yes
source: Yes, please
et: Jah
ru: Да

# no
source: I know the rules
et: Ei
ru: Спасибо, я знаю правила

source: Congratulations
et: Palju õnne
ru: Поздравляем

# youWon
source: You solved the puzzle!
et: Sudoku on lahendatud õigesti!
ru: Судоку решено правильно

source: OK
ru: Хорошо

source: Technique purpose
et: Tehnika eesmärk
ru: Цель техники

# techniquePurposeCellValue
source: finding value of a cell
et: ruudu väärtuse leidmine
ru: нахождение значения клетки

# techniquePurposeRemoveCandidates
source: removal of candidates from cells
et: kandidaatide eemaldamine ruutudest
ru: удаление кандидатов из клеток

# techniquePurposeCellValueAndRemoveCandidates
source: finding value of a cell and removal of candidates from cells
et: ruudu väärtuse leidmine ja kandidaatide eemaldamine ruutudest
ru: нахождение значения клетки и удаление кандидатов из клеток

# sudokuRulesDescription1
source: Sudoku is a logic game that consists of a 9x9 grid divided into 3x3 regions or blocks, where some of the cells are filled with numbers.
et: Sudoku on loogikamäng, mis kujutab endast 9x9 ruudustikku, mis on jagatud omakorda 3x3 regioonideks või plokideks, kus mõned ruudud on täidetud numbritega.
ru: Судоку — это логическая игра, состоящая из сетки 9x9, разделенной, в свою очередь, на области или блоки 3x3, где некоторые клетки заполнены числами.

# sudokuRulesDescription2
source: To solve Sudoku, you have to fill in the empty cells with numbers.
et: Sudoku lahendamiseks tuleb täita vabad ruudud numbritega.
ru: Чтобы решить Судоку, надо заполнить пустые клетки цифрами.

# sudokuRulesDescription3
source: Sudoku is considered correctly solved if all the cells are filled in according to the rules. The rules are as follows: - all rows, columns and blocks must contain numbers from 1 to 9 - numbers cannot be repeated in any row, column or block.
et: Sudoku peetakse korrektselt lahendatuks, kui kõik ruudud on täidetud vastavalt reeglitele. Reeglid on järgmised: - kõik read, veerud ja plokid peavad sisaldama numbreid 1-st 9-ni - numbrid ei saa korduda üheski reas, veerus ja plokis.
ru: Судоку считается правильно решенным, если все клетки заполнены по правилам. Правила следующие: - все строки, столбцы и блоки должны содержать числа от 1 до 9 - числа не могут повторяться ни в одной строке, столбце и блоке.

# sudokuRulesDescription4
source: Rows, columns and blocks can all be referred to as groups. Using these rules it is possible to find the values of some cells. If there is only one empty cell left in a group, then the only number 1-9 that is not in the group can be placed there immediately. For example, the block below contains all numbers except 7. Therefore, the empty cell can be filled with 7.
et: Ridu, veerge ja plokke saab nimetada ühe sõnaga - grupp. Kasutades neid reegleid on võimalik leida mõnede ruutude väärtusi. Kui mingis grupis on jäänud ainult üks tühi ruut, siis võib sinna kohe panna ainus number 1-9, mida grupis ei ole. Näiteks allpool olevas plokis on olemas kõik numbrid peale 7. Seepärast võib tühja ruutu kohe panna 7.
ru: Строки, столбцы и блоки можно называть одним словом - группа. Используя эти правила, можно найти значения некоторых клеток. Если в группе остался только одна пустая клетка, то туда можно сразу поставить единственное число 1-9, которого нет в группе. Например, в блоке ниже есть все числа, кроме 7. Поэтому в пустую клетку можно сразу поставить 7.

# solvePuzzleLearning
source: Now you apply the new knowledge to solve this problem:
et: Nüüd on sul võimalus kasutada uusi teadmisi, et lahendada ülesannet:
ru: Попробуй решить задачу с помощью полученных знаний:

# problemChangesLeft
source: Number of cells that need to be changed:
et: Ruutude arv, mida tuleb muuta:
ru: Число клеток, которые нужно изменить:

# problemIncorrectlyChangedCells
source: Incorrectly changed cells:
et: Valesti muudetud ruudud:
ru: Неправильно изменённых клеток:

# problemSolved
source: You solved the problem!
et: Ülesanne on lahendatud õigesti!
ru: Задача решена правильно!

# findSolutionForCell
source: Find the value of the highlighted cell
et: Leia märgitud ruudu väärtust
ru: Найди значение отмеченной клетки

# findSolutionForCellRemoveCandidates
source: Find the value of the highlighted cell and then remove needed candidates
ru: Найди значение отмеченной клетки и убери нужные кандидаты

# removeCellsCandidates
source: Apply technique to the highlighted cells and removed needed candidates
ru: Примени технику и убери нужные кандидаты

# pencilMarksDescription1
source: Pencil marks are used to mark the numbers that fit a given cell when the value of the cell is not known. Matching numbers are otherwise known as candidates.
et: Pliiatsimärke kasutatakse selleks, et märkida numbrid, mis sobivad antud ruutu, kui ruudu väärtust ei ole teada. Sobivaid numbreid nimetatakse teisiti kandidaatideks.
ru: Заметки используются для того, что отмечать числа, которые подходят в клетку, когда значение клетки еще неизвестно. Подходящие числа также известны как кандидаты.

# pencilMarksDescription2
source: At the beginning, all the numbers that could be entered in the cell that would not break the rules are added. Pencil marks help to keep track of the possible values of the cells. Also, many Sudoku solving techniques are based on the use of pencil marks. In this app, you need to turn on pencil mark mode to enter pencil marks. This can be done by pressing a button with the pencil.
et: Alguses lisatakse kõiki numbreid, mida võiks ruutu sisestada, mis ei rikuks reegleid. Pliiatsimärgid aitavad jälgida, ruutude võimalike väärtusi. Samuti põhinevad paljud Sudoku lahendamise tehnikad pliiatsimärkide kasutamisel. Selles rakenduses tuleb märkmete sisestamiseks lülitada sisse pliiatsimärkide režiimi. Seda saab teha vajutades pliiatsiga nupu.
ru: В начале вносятся все числа, которые можно поставить в клетку, не нарушая правила. Заметки помогают отслеживать возможные значения клеток. Кроме того, многие техники решения Судоку основаны на использовании заметок. В этом приложении, чтобы вводить заметки, нужно включить режим заметок. Это можно сделать, нажав кнопку с карандашом.

# pencilMarksProblem
source: Fill in candidates for the highlighted cell:
et: Täida märgitud ruudu kandidaadid:
ru: Заполни кандидаты в отмеченной клетке:

# lastPossibleNumberDescription1
source: One of the simple techniques is the last possible number that fits into a cell. Only one number fits a cell because all others cannot be in that cell since they already exist in units associated with that cell (peers of the cell).
et: Üks lihtsamatest tehnikatest on ainus võimalik number, mis sobib mingisse ruutu. Ruutu sobib ainult üks number, sest kõik muud ei saa olla selles ruudus, kuna nad on juba olemas selle ruuduga seotud ühikutes (ruudu kaaslastes).
ru: Одна из самых простых техник - это единственное возможное число, которое подходит в клетку. В клетку подходит только одно число, потому что все остальные числа не могут быть в этой клетке, так как они уже есть в группах, связанных с этой клеткой (все клетки, связанные с данной клеткой какими-либо группами, также можно назвать клетками-компаньонами данной клетки)

# lastPossibleNumberDescription2
source: In the picture you can see the cell marked in red. Only the number 7 can be in a given cell, because all other numbers 1-9 are present in the units associated with this cell - numbers 1, 3, 4 and 5 are in the same row, numbers 2, 6 (and also the aforementioned 3 and 5) - in the same block, and numbers 8 and 9 (and 2) - in the same column. Only number 7 remains.
et: Pildil võib näha punasega märgitud ruutu. Antud ruudus saab olla ainult number 7, sest kõik muud numbrid 1-9 on olemas selle ruuduga seotud ühikutes – numbrid 1, 3, 4 ja 5 on samas reas, numbrid 2, 6 (ja ka eelmainitud 3 ja 5) – samas plokis ning numbrid 8 ja 9 (ja 2) – samas veerus. Jääb ainult number 7.
ru: На картинке можно увидеть клетку, отмеченную красным. Эта клетка может содержать только число 7, потому что все остальные числа 1-9 уже есть в группах, связанных с этой клеткой - числа 1, 3, 4 и 5 находятся в том же ряду, числа 2, 6 (а также вышеупомянутые 3 и 5) - в том же блоке, а числа 8 и 9 (и 2) - в том же столбце. Остается только число 7.

# lastRemainingCellDescription1
source: Sometimes it happens that there are several free spaces in a block, row or column, but a number can only be placed in one cell because it cannot be placed in any other cell.
et: Mõnikord juhtub nii, et plokis, reas või veerus on mitu vaba kohta, kuid mingi numbri saab panna ainult ühte ruutu, kuna ta ei saa olla üheski teises ruudus.
ru: Иногда бывает так, что в блоке, строке или столбце есть несколько свободных мест, но число можно поставить только в одну клетку, потому что оно не может быть ни в одной другой клетке.

# lastRemainingCellDescription2
source: In the picture you can see that the column marked in red is missing several numbers, including the number 6. There are 4 empty places in the column, but 6 can only be placed in one of them, because in all other places it violates the Sudoku rules. Therefore, the number 6 is in the sixth row.
et: Pildil võib näha, et punasega märgitud veerus on puudu mitu numbrit, sealhulgas number 6. Veerus on 4 tühja kohta, kuid 6 saab panna ainult ühte nendest, sest kõikides teistes kohtades rikub see Sudoku reegleid. Seetõttu asub number 6 kuuendas reas.
ru: На картинке видно, что в столбце, отмеченном красным, отсутствуют несколько чисел, в том числе 6. В столбце 4 пустых места, но 6 можно разместить только в одном из них, потому что во всех в других местах она будет нарушать правила Судоку. Следовательно, число 6 находится в шестом ряду.

# lastRemainingCellDescription3
source: There are variations of this technique. In the picture below, one column is marked in red. The number 4 is missing in this column, and there is only one suitable place for it - in row 5. The empty cells in rows 2 and 9 are not suitable, because the number 4 already exists in these blocks (colored orange).
et: Sellel tehnikal on olemas variatsioonid. Allpool oleval pidil on üks veerg märgitud punase värviga. Selles veerus puudub number 4 ning selle jaoks on ainult üks sobiv koht – 5. reas. Vabad ruudud 2. ja 9. reas ei sobi, kuna nendes plokkides (värvitud oranžiga) on juba olemas number 4.
ru: Существуют вариации этой техники. На картинке ниже один столбец выделен красным цветом. В этом столбце отсутствует цифра 4, и для нее есть только одно подходящее место — в пятом ряду. Свободные клетки в рядах 2 и 9 не подходят, потому что в этих блоках уже есть число 4 (выделено оранжевым цветом).

# lastRemainingCellDescription4
source: The same situation can be seen from the other side - in the picture there is a block marked in red. There is no 4 in this block and it can only be placed in one cell, because the number 4 (colored in red) already exists in the columns of other free cells (colored in orange).
et: Sama olukorda võib vaadelda teisest küljest – pildil on punasega märgitud plokk. Selles plokis ei ole 4 ja seda saab panna ainult ühte ruutu, sest muude vabade ruutude veergudes (värvitud oranžiga) on juba olemas number 4 (värvitud punasega).
ru: На ту же ситуацию можно посмотреть и с другой стороны — на картинке блок отмечен красным. В этом блоке нет 4, и его можно разместить только в одной клетке, потому что столбцы других свободных клеток (оранжевого цвета) уже содержат число 4 (отмечены красным).

# nakedSingleDescription1
source: Starting with this technique, pencil marks must be used to mark cell candidates to apply the techniques.
ru: Начиная с этой техники, для применения техник необходимо использовать заметки, чтобы отмечать кандидаты клеток.

# nakedSingleDescription2
source: Naked candidates include several techniques with the same principle and goal - to remove possible candidates from the cells.
ru: Голые кандидаты (также могут называться очевидными) включают в себя сразу несколько техник с одними принципом и целью - удаление кандидатов из клеток.

# nakedSingleDescription3
source: Naked single - if a cell's candidates are filled and there is only one candidate in that cell, then it is the value of that cell. This candidate can be removed from other cells in the same row, column and block.
ru: Голые единицы - если клетка заполнен кандидатами и в этой клетке есть только один кандидат, то этот кандидат является значением данной клетки. Этот кандидат может быть удален из других клеток в той же строке, столбце и блоке.

# nakedSingleDescription4
source: In the first picture, you can see that there is only one candidate in the cell marked in blue. This means that the other numbers do not fit into the cell, because that would break the rules.
ru: На первой картинке можно увидеть, что в клетке, отмеченной синим, есть только один кандидат. Это означает, что другие числа не подходят в клетку, потому что это нарушило бы правила.

# nakedSingleDescription5
source: Since the number 2 is the only option, it can be put as a cell solution and remove 2 from the candidates of the makred cells' peers - they are marked in red in the second picture.
ru: Поскольку число 2 является единственным вариантом, её можно поставить как значение клетки и удалить 2 из кандидатов клеток-компаньонов - они отмечены красным на второй картинке.

# nakedPairDescription1
source: Naked pair - if there are two cells that are in the same column, row or block and those cells have only two possible candidates, then those numbers are contained in the given cells and can be removed from the candidates of other cells.
ru: Голая пара - если есть две клетки, которые находятся в одном столбце, строке или блоке, и у этих клеток есть только два возможных кандидата, то эти числа точно содержатся в данных клетках и ​​могут быть удалены из кандидатов других клеток.

# nakedPairDescription2
source: In the first picture, two cells are marked in red - they have two possible candidates, 1 and 2. The cells are in the same block and in the same row, so the naked pair technique can be applied. It can be said that the numbers one and two are contained in the marked cells, as they cannot contain any other number.
ru: На первой кратинке две клетки отмечены красным — у них есть два возможных кандидата, 1 и 2. Клетки находятся в одном блоке и в одной строке, поэтому можно применить технику голых пар. Можно точно сказать, что числа 1 и 2 содержатся в отмеченных клетках, так как они не могут содержать никаких других чисел.

# nakedPairDescription3
source: Since the numbers cannot be repeated in units, it allows to remove some candidates marked in red in the second picture. Since the cells containing the naked pair are in the same block, candidates 1 and 2 can be removed in all other cells of the block. The same can be done for sixth row, because cells with a naked pair are in the same row.
ru: Поскольку числа не могут повторяться в группах, это позволяет удалить некоторые кандидаты, которые отмечены красным на второй картинке. Поскольку клетки, содержащие голую пару, находятся в одном блоке, кандидаты 1 и 2 могут быть удалены во всех других клетках блока. То же самое можно сделать для с клетками в 6 ряду, потому что клетки с голой парой находятся так же в одном ряду.

# nakedTripleDescription1
source: Naked triple - the principle is the same as in the case of pairs - if the three connected cells contain only three possible candidates, then these numbers are located in the given cells and cannot be in the companions of the cells - they can be removed from the peers' candidates.
ru: Голая тройка - принцип такой же, как и в случае с парами - если три клетки в группе содержат только три возможных кандидата, то эти числа точно находятся в данных клетках и ​​не могут быть в клетках-компаньонах данных клеток, поэтому они могут быть удалены из клеток-компаньонов.

# nakedTripleDescription2
source: The picture shows one block where there are cells containing naked triple. Candidates in these cells are 2, 4, 5, they are marked in green. Since three cells can only contain these three numbers, it can be said that they are located in these cells. Because of this, these numbers can be removed from among the candidates for the block in other cells. In this example, the naked triple is located in cells that are associated with only one unit - the block, so in the example, candidates outside the block cannot be removed. It is also worth noting that all the numbers do not necessarily have to be contained in all three cells - in the example, one of the cells contains only the numbers 4 and 5.
ru: На картинке показан блок, где есть клетки, содержащие голые тройки. Кандидаты в этих клетках - 2, 4, 5, они отмечены зеленым цветом. Поскольку три клетки могут содержать только эти три числа, можно утверждать что эти числа точно находятся в данных клетках. Поэтому эти числа могут быть удалены из кандидатов других клеток в блоке. В данном примере голая тройка находится в клетках, которые связаны только с одной группой - блоком, поэтому в примере можно удалять кандидаты только внутри блока. Также стоит отметить, что не все числа должны обязательно содержаться во всех трех клетках - в примере одна из клеток содержит только числа 4 и 5.

# nakedTripleDescription3
source: The same principle can be applied to a larger number of cells - the main thing is that the number of possible candidates coincides with the number of cells.
ru: Тот же принцип можно применить и к большему количеству клеток - главное, чтобы количество возможных кандидатов совпадало с количеством клеток.

# hiddenSingleDescription1
source: Hidden Single - If there is a cell in the unit with a pencil mark that is not present in any other cell in the unit, then the number must be in that cell, as that is the only possible place.
ru: Скрытые единицы — если в группе есть клетка с кандидатом, которого нет ни в одной другой клетке группы, то число должно быть в этой клетке, так как это единственно возможное место.

# hiddenSingleDescription2
source: The picture shows a candidate marked in green, which is contained in only one cell in the lower block. The other cells in the block cannot contain a 9, because there are already 9s in those columns. Since there are no other variants, it can be said that the number 9 is in the given cell , that is why other candidates can be removed from this cell and the solution can be set to 9.
ru: На картинке показан кандидат, отмеченный зеленым, который содержится только в одной клетке в нижнем блоке. Другие клетки в блоке не могут содержать 9, потому что в этих столбцах уже есть 9. Так как нет других вариантов, можно утверждать, что число 9 находится в данной клетке, поэтому из этой клетки можно убрать другие кандидаты и поставить туда 9.

# hiddenPairDescription1
source: Hidden pair is similar to hidden single, but in this case the number of candidates and cells is 2. If there are two cells in a unit with 2 pencil marks that are not present in any other cell, then all other candidates in those cells can be removed because the 2 given numbers are in these cells.
ru: Скрытая пара похожа на скрытые единицы, но в данном случае количество чисел и клеток равно 2. Если в блоке есть две клетки с двумя кандидатами, которых нет ни в одной другой клетке, то все остальные кандидаты в этих клетках можно убрать, потому что в этих клетках находятся 2 этих числа.

# hiddenPairDescription2
source: The picture shows candidates 3 and 5 marked in green, which are contained in only two cells in the given block. Since these numbers cannot be in other cells, they can be claimed to be contained in the given cells and all other candidates can be removed from them. This changes a hidden pair into a naked pair and it can be further used to remove other candidates.
ru: На картинке показаны кандидаты 3 и 5, отмеченные зеленым цветом, которые содержатся только в двух клетках в данном блоке. Поскольку эти числа не могут быть в других клетках, можно утверждать, что они содержатся именно в этих клетках и все остальные кандидаты можно из этих клеток убрать. Затем скрытая пара меняется на голую пару и может дальше использоваться для удаления других кандидатов.
