Repository: Majuo/thesis
Catalog: sudoku_app/lib/l10n/app_*.arb
Languages: et, ru

# hiddenTripleDescription1
source: Hidden triple - the principle is the same as in hidden pair, only the number of candidates and cells is 3. If there are three cells with three pencil marks in a unit, which are only in these cells, then other candidates can be removed in these cells.
ru: Скрытая тройка - принцип такой же, как и со скрытой парой, только количество кандидатов и клеток равно 3. Если в блоке есть три клетки с тремя кандидатами, которые находятся только в этих клетках, то другие кандидаты можно в этих клетках убрать.

# hiddenTripleDescription2
source: In the picture you can see a block with candidates 2, 4 and 9 marked in green in three cells. Using the same principle as for the hidden pair, all other candidates can be removed from these cells.
ru: На картинке показан блок с кандидатами 2, 4 и 9, отмеченными зеленым цветом в трех клетках. Используя тот же принцип, что и для скрытой пары, можно убрать все остальные кандидаты из этих клеток.

# hiddenTripleDescription3
source: The same principle works with a larger number of cells, but such variants are rare.
ru: Тот же принцип работает и с большим количеством клеток, но такие варианты встречаются редко.

# pointingPairDescription1
source: The pointing pair technique can be used if a candidate occurs twice in one block and both locations are in the same row or column. Since the number must appear 1 time in the block, it must be located in one of the two given cells. Therefore, this candidate can be removed from candidates of other cells in row / column.
ru: Технику указывающих пар можно использовать, если кандидат встречается дважды в одном блоке и обе клетки находятся в одной строке или столбце. Поскольку число должно содержаться в этом блоке, оно должно находиться в одном из двух заданных клеток. Следовательно, этот кандидат может быть удален из других клеток в строке/столбце.

# pointingPairDescription2
source: The picture shows candidates for one of the columns marked in red and green. Since the number 5 must be contained in the top block and there are only two matching cells, it is located in one of these cells. It can be concluded that the number 5 cannot be in the block containing the candidate marked in red cell.
ru: На картинке показаны кандидаты в одном из столбцов, отмеченные красным и зеленым цветами. Поскольку число 5 должно содержаться в верхнем блоке, а подходящих клетки всего две, оно находится в одной из этих клеток. Из этого можно сделать вывод, что число 5 не может быть в других клетках столбца, поэтому её можно убрать из клетки в нижнем блоке.

# pointingTripleDescription1
source: The pointing triple technique has the same principle as the pointing pair - if a pencil mark occurs three times in a block and all cells containing it are in one row or column, then this pencil mark can be removed from other cells in the row / column. An example of a pointing triple can be seen in the picture.
ru: Техника указывающих троек имеет тот же принцип, что и указывающие пары - если кандидат встречается в блоке три раза и все клетки с ним находятся в одной строке или столбце, то это число можно удалить из других клеток в группе. Пример указывающей тройки можно увидеть на картинке.

# xWingDescription1
source: The X-Wing technique is considered the simplest among advanced techniques.
ru: Техника X-крыло считается самой простой среди продвинутых техник.

# xWingDescription2
source: In order to apply the X-Wing technique, it is necessary to find two cells in two rows (two in each row) where there is a candidate that is not present in the other cells of the rows. The cells in both rows must be in the same columns.
ru: Чтобы применить технику X-крыло, необходимо найти две клетки в двух рядах (в каждом ряду), где есть кандидат, которого нет в других клетках этих рядов. Клетки в обоих рядах должны также находиться в одних и тех же столбцах.

# xWingDescription3
source: One can imagine that the cells form a rectangle, in which the cells are the vertices of the rectangle. In the picture, these cells are marked in orange, the candidate to be considered is 9.
ru: Можно представить, что клетки образуют прямоугольник, в котором клетки являются вершинами прямоугольника. На картинке эти клетки отмечены оранжевым цветом, рассматриваемый кандидат - 9.

# xWingDescription4
source: The technique is based on the fact that the candidate must appear 2 times in the given 4 cells - once in each row, and at the same time these numbers are located at the opposite vertices of the 'rectangle', i.e. on the diagonals of the rectangle, because otherwise they would violate the basic rule of Sudoku - numbers cannot repeat in the unit. In any case, the number 9 in both columns is located in one of the cells marked in orange. Therefore, this candidate can be removed from the other cells in the columns.
ru: Техника заключается в том, что кандидат должен появиться 2 раза в заданных 4-х клетках - по одному разу в каждом ряду, и при этом эти числа расположены в противоположных вершинах 'прямоугольника', т.е. на диагоналях прямоугольника, так как в противном случае они нарушили бы основное правило судоку - числа не могут повторяться в группе. В любом случае число 9 в обоих столбцах расположено в одной из клеток, отмеченных оранжевым цветом. Следовательно, этот кандидат может быть удален из других клеток в столбцах.

# xWingDescription5
source: The technique can also be used the other way around - if the candidates are selected in two columns and the candidates are removed in rows. An example of such a variation is shown in the second picture. As a result, the candidates marked in red in rows 3 and 9 are removed.
ru: Технику можно использовать и наоборот - если кандидаты выбираются в двух столбцах, а удаляются в рядах. Пример такой вариации показан на второй картинке. В результате кандидаты, отмеченные красным в рядах 3 и 9, удаляются.

# yWingDescription1
source: Unlike the X-Wing technique, the Y-Wing technique is based on three cells and three candidates, the fourth cell in this technique is the cell where the candidate can be removed. This is the simplest Y-Wing variant, but there are others. For better understanding, it is reasonable to start with a simple variant.
ru: В отличие от техники X-крыла, техника Y-крыло основана на трех клетках и ​​трех кандидатах, четвертая клетка в этой технике — это клетка, из которой можно удалить кандидата. Это самый простой вариант Y-крыла, но есть и другие. Для понимания техники разумно начать с простого варианта.

# yWingDescription2
source: Let A, B and C be three numbers. In order to be able to apply the Y-Wing technique, you need to find three cells that are arranged to form a right angle (they can be imagined as 3 vertices of a rectangle). In all three cells there must be exactly two candidates. The cell at the top of the right angle must contain the candidates AB, the other cells must contain the candidates AC and BC (that is, the number C and one of the numbers A and B). One possible variant of the placement of the cells is shown in the first picture.
ru: Пусть A, B и C будут тремя числами. Чтобы иметь возможность применить технику Y-крыла, нужно найти три клетки, образующих прямой угол (их можно представить как 3 вершины прямоугольника). Во всех трех клетках должно быть ровно два кандидата. Клетка, находящаяся в вершине угла, должна содержать кандидаты AB, остальные клетки должны содержать кандидаты AC и BC (то есть число C и одно из чисел А и В). Один из возможных вариантов размещения клеток показан на первом рисунке.

# yWingDescription3
source: If the number A is in the cell AB, then the number C is in the cell AC. On the other hand, if the number B is in the cell AB, then the number C is in the cell BC. In both cases, the number C is either in the cell AC or BC. From this we can conclude , that the cell intersected by the cells AC and BC (at the fourth vertex of the rectangle) cannot under any circumstances contain the number C.
ru: Если число A находится в клетке AB, то число C находится в клетке AC. С другой стороны, если число B находится в клетке AB, то число C находится в клетке BC. В обоих случаях число С находится либо в клетке АС, либо в клетке ВС. Отсюда можно сделать вывод, что клетка, пересекающаяся с клетками АС и ВС (в четвертой вершине прямоугольника), ни при каких условиях не может содержать число С.

# yWingDescription4
source: The second picture shows an example of a simple variation of the Y-Wing technique. In this example, the candidate 3 is removed from the cell located at the intersection of the orange colored row and column.
ru: На второй картинке показан пример простого варианта техники Y-крыла. В этом примере кандидат 3 удаляется из клетки, расположенной на пересечении оранжевого ряда и оранжевого столбца.

# yWingDescription5
source: There are other variations of the Y-Wing technique. In the simplest variation, one cell was connected to the middle (AB) cell by row, the other cell - by column, but it doesn't necessarily have to be like that. There is a variant where one of the cells is connected to the middle cell by the block - they are located in one block. You can see such a variant in the third picture.
ru: Есть и другие вариации техники Y-крыла. В самой простой вариации один клетка соединена со средней (AB) клеткой по ряду, другая клетка - по столбцу, но это не обязательно должно быть так. Есть вариант, когда одна из клеток соединяется со средней клеткой по блоку - они расположены в одном блоке. Такой вариант можно увидеть на третьей картинке.

# yWingDescription6
source: In this variation, candidates can be removed in multiple cells. The candidate marked in red in the upper block can be removed because it is in the cross-zone of column 1 and the upper block. In other words, both cells of the Y-Wing, where there can be 4, are companions of this cell and one among them definitely contains the number 4. The same can be said about the candidates marked in red in the lower block. There, the lower block and the 3rd column intersect.
ru: В этом варианте кандидаты могут быть удалены в нескольких клетках. Кандидат, отмеченный красным в верхнем блоке, может быть удален, поскольку он находится в зоне пересечения столбца 1 и верхнего блока. Другими словами, обе клетки Y-крыла, где может быть 4, являются клетками-компаньонами этой клетки и одна из них обязательно содержит число 4. То же самое можно сказать и о кандидатах, отмеченных красным в нижнем блоке. Здесь пересекаются нижний блок и 3-й столбец.

# swordfishDescription1
source: The swordfish technique is basically similar to the X-Wing technique, its purpose is also to eliminate candidates. In the X-Wing technique, the squares formed a 2x2 matrix, in the Swordfish technique it is a 3x3 matrix.
ru: Техника Рыба-меч в основном аналогична технике X-крыла, ее цель также состоит в том, чтобы убирать кандидаты. В технике X-крыла клетки образовывали матрицу 2x2, в технике Рыба-меч они образовывают матрицу 3x3.

# swordfishDescription2
source: To apply the technique, you have to find 3 rows where a number can be in three squares and these squares are located in the same columns. You can see an example of the location of the squares in the first picture, the squares are colored orange.
ru: Чтобы применить технику, нужно найти 3 ряда, где число может быть в трех клетках и все ​​эти клетки расположены в трех столбцах. Вы можете увидеть пример расположения клеток на первой картинке, клетки окрашены в оранжевый цвет.

# swordfishDescription3
source: Since a given number must appear in every row, and there are only three columns in three rows where this number can be located, it can be said that in each column this number is located in one of the three given rows. Therefore, in the given columns, the given number can be removed from all other squares from among the candidates - these squares are marked in red in the picture abouve.
ru: Поскольку данное число должно присутствовать в каждом ряду, а в трех рядах есть только три столбца, где может находиться это число, можно сказать, что в каждом столбце это число находится в одном из трех заданных рядов. Поэтому в данных столбцах это число может быть удалено из всех остальных клеток - эти клетки отмечены на рисунке красным цветом.

# swordfishDescription4
source: The Swordfish technique is considered an extension of the X-Wing technique, and the reason why the Swordfish technique works can be explained with the help of X-Wing. For example, you can look at the bottom row of the 3x3 matrix shown in the first picture - there the given number can be located in three squares. The variants are shown in the second picture (the location of the number is marked in green).
ru: Техника Рыба-меч считается расширением техники X-крыла, и причину, по которой работает техника Рыба-меч, можно объяснить с помощью X-крыла. Например, можно посмотреть на нижний ряд матрицы 3х3, показанной на первой картинке - там заданное число может располагаться в трех клетках, варианты показаны на второй картинке (расположение числа отмечено зеленым цветом).

# swordfishDescription5
source: In each variant, the entered number removes some possible positions from the matrix and other squares - they are marked in red in the figure. However, in each variant, 4 squares remain in the matrix (colored orange), which form the required position for the X-Wing technique.
ru: В каждом варианте введенное число удаляет некоторые возможные позиции из матрицы и других клеток - они отмечены на рисунке красным цветом. Однако в каждом варианте в матрице остается 4 клетки (окрашены оранжевым цветом), которые формируют нужную позицию для техники X-крыла.

# swordfishDescription6
source: A number of candidates can be removed using the X-Wing technique - they are marked in blue in the figure. In all three variants, candidates were removed from all the squares that are colored red in the first image. The same situation occurs in the other variants if you try to put the number in the upper or in the middle row - some candidates are removed by the given number and all others - using the X-Wing technique.
ru: Еще несколько кандидатов можно удалить с помощью техники X-крыла — они отмечены синим цветом на рисунке. Во всех трех вариантах были удалены кандидаты из всех клеток, окрашенных в красный цвет на первой картинке. Такая же ситуация возникает и в других вариантах, если попытаться поставить число в верхний или средний ряд - некоторые кандидаты удаляются поставленным числом, а все остальные - с помощью техники X-крыла.

# swordfishDescription7
source: The swordfish technique also works the other way around, when there are three columns with three possible number positions. In this case, candidates are removed from the rows. An example of such a variation is shown in the third image.
ru: Техника Рыбы-меч работает и наоборот, когда есть три столбца с тремя возможными позициями чисел. В этом случае кандидаты удаляются из рядов. Пример такой вариации показан на третьей картинке.

# swordfishDescription8
source: It can also be noticed that candidate 4 does not appear exactly 3 times in each column in this example. In fact, applying the Swordfish technique requires candidates to appear at least 2 times in each column (or row, as in the previous figures). This does not change the technique principle and the squares colored in orange are still the only possible places in these rows (columns), just the number of possible placement combinations is smaller. Such a variant of the Swordfish technique is called 2-3-2 Swordfish - according to the number of candidates in the columns (rows). The variation that was before, if the candidates appeared 3 times in all rows and formed a complete 3x3 matrix, it is called 3-3-3 Swordfish.
ru: Также можно заметить, что в этом примере кандидат 4 не появляется ровно 3 раза в каждом столбце. На самом деле, применение техники Рыба-меч требует, чтобы кандидаты появлялись как минимум 2 раза в каждом столбце (или ряду, как на предыдущей картинке). Это не меняет принципа техники, и клетки, окрашенные в оранжевый цвет, по-прежнему являются единственно возможными местами в этих рядах (столбцах), просто количество возможных комбинаций размещения меньше. Этот вариант техники Рыба-меч называется Рыба-меч 2-3-2 — по количеству кандидатов в столбцах (рядах). Предыдущий вариант, где кандидаты появлялись 3 раза во всех рядах и образовывали полную матрицу 3x3, называется Рыба-меч 3-3-3.
